{
  "works": [
    {
      "title": "B&B car renting mobile app",
      "description": "A comprehensive car rental management application with reservation system for clients, featuring booking management, payment processing, and fleet tracking.",
      "client": "B&B car renting",
      "category": "mobile, featured",
      "images": [
        "uploads/baae32db3ea902c50274269ff0e3346c",
        "uploads/47b89ec79b9ab9356aa0470d94b154ba",
        "uploads/98916a7b6ce85b10fa3e7243cf1769cb",
        "uploads/0421ee52c91bab3f11d8f342d0d4649d",
        "uploads/6b568a681f0242f6269ffd2c85934147",
        "uploads/fbbe77fff9fc0664c6fa82799889c345",
        "uploads/655b823ff5bb28c52826ee52d5ec6ce5"
      ]
    },
    {
      "title": "MAXTEAM Website",
      "description": "This year i have been contacted by KODIJI MOHAMED ceo and founder of MAXTEAM VISUALS so i make a website for them, one of the best companies of filmaking and audio visual in Morocco. their websites has a modern and minimalist UI, with a lot of different features they've needed. https://maxteamvisual.com/",
      "client": "MAXTEAM VISUAL",
      "category": "Website",
      "images": [
        "uploads/86b396f3d7d286e16b49aadaa70ec1a8",
        "uploads/5769361c533e7d205fb3a7aba7417fad"
      ]
    },
    {
      "title": "web-based management system",
      "description": "a comprehensive web-based management system designed for businesses, likely in the retail or wholesale sector, given its features related to sales, purchases, products, and reporting. The application provides a centralized platform for managing various aspects of business operations, from user administration to detailed financial reporting.  ## Key Features:  ### 1. Dashboard/Home Page  The main dashboard provides a quick overview of key business metrics. It displays: - Total Sales - Net Sales - Unpaid Invoices - Total Sell Return - Total Purchases - Unpaid Purchases - Total Purchase Return - Expenses  It also includes graphical representations of sales over the last 30 days and the current business year, offering visual insights into performance.  ### 2. User Management  This section allows for the administration of users within the system. It includes: - **Users:** A list of all registered users with details such as username, name, role, and email. It supports actions like adding, editing, viewing, and deleting users. - **Roles:** Management of different user roles and their associated permissions. - **Commission Agents:** Functionality to manage commission-based agents.  ### 3. Product Management  This module is crucial for managing the inventory and product catalog. It features: - **Product List:** Displays all products with details like product image, actions, product name, business location, unit purchase price, selling price, current stock, product type, category, brand, tax, and SKU. It supports adding new products, updating prices, printing labels, managing variations, importing products, and opening stock. - **Categories & Brands:** Organization of products into categories and brands for better management. - **Units & Warranties:** Management of product units and warranties.  ### 4. Sales Management  This section handles all sales-related operations: - **All Sales:** A comprehensive list of all sales transactions, including date, invoice number, customer name, contact number, location, payment status, payment method, total amount, total paid, due amount, sell return due, shipping status, total items, and sales notes. It allows for viewing, editing, deleting, printing invoices, and managing payments. - **Add Sale:** Functionality to record new sales. - **POS (Point of Sale):** A dedicated interface for quick sales transactions. - **Drafts & Quotations:** Management of sales drafts and quotations. - **Sell Return List:** Tracking of returned sales. - **Shipments & Discounts:** Management of product shipments and applied discounts. - **Import Sales:** Option to import sales data.  ### 5. Reports  The reporting module provides various analytical insights into business performance: - **Profit/Loss Report:** Detailed report on profit and loss, including COGS (Cost of Goods Sold), gross profit, and net profit. It breaks down profit by product, category, and brand. - **Purchase & Sale Report:** Comprehensive reports on purchasing and selling activities. - **Tax Report:** Overview of tax-related transactions. - **Supplier & Customer Report:** Reports focused on interactions with suppliers and customers. - **Customer Group Report:** Analysis of sales based on customer groups. - **Stock Report & Adjustment Report:** Insights into inventory levels and adjustments. - **Product Trend & Item Report:** Analysis of product performance and individual item details. - **Product Purchase & Sale Report:** Specific reports on product-wise purchases and sales. - **Payment Reports:** Reports on purchase and sales payments.  ## Technology Stack (Inferred):  Based on the observed features and common web development practices, the application likely utilizes: - **Frontend:** HTML, CSS, JavaScript (possibly a framework like React, Angular, or Vue.js for dynamic interfaces). - **Backend:** A server-side language (e.g., PHP, Python, Node.js, Ruby on Rails) with a robust framework. - **Database:** A relational database (e.g., MySQL, PostgreSQL) for structured data storage.  ## Conclusion:   is a robust and feature-rich business management system that streamlines various operational processes. Its intuitive interface and comprehensive reporting capabilities make it a valuable tool for businesses seeking to efficiently manage their sales, inventory, and financial data. The system demonstrates strong capabilities in data management, user interaction, and analytical reporting, making it a significant project for a developer's portfolio.",
      "client": "Optician",
      "images": [
        "/uploads/827ecb669025ea2c1d7e8ced8dd403ac",
        "/uploads/455be447f37f8fc309364372454401f6",
        "/uploads/08d9a166b982ebac773cee05866ba16b",
        "/uploads/ac6b36d716c03a600ee447513ee18cb0",
        "/uploads/31227f1264d48f10dfb5474a941c3a2f"
      ]
    },
    {
      "title": "Hair salon",
      "description": "I designed and developed a fully responsive website for a modern hair salon, focusing on elegant design and user experience. The site showcases the salon’s team, services, gallery, and includes a booking CTA for client reservations. Built with HTML, CSS, and Tailwind CSS, the layout adapts smoothly across all devices. Emphasis was placed on aesthetic presentation, brand identity, and clean code structure to reflect the salon’s premium image.  Key Features:  Responsive layout optimized for desktop and mobile  Hero section with strong branding and call-to-action  Services section with price breakdown  Gallery to showcase the salon's work  Team introduction section  Smooth scrolling and clean UI",
      "client": "Hair salon",
      "images": [
        "/uploads/826155cec6c214529d5f0b1d2c0e8a96",
        "/uploads/503bb6a238694471166c271725dc2a75",
        "/uploads/1206e41c05c67d2de62fd6fa3a6f4775",
        "/uploads/2264dff3ac6e678ccbd4bb53787d4f79",
        "/uploads/9fe2820cdf18f6470830dd33edc78172"
      ]
    },
    {
      "title": " B&B University – Mobile Academic Management App for EMSI",
      "description": "B&B University is a mobile application developed in Java using Android Studio and Firebase, designed to digitize and streamline academic management for EMSI. This app provides tailored dashboards for students, professors, and administrators, enabling secure authentication, real-time grade entry, automatic GPA calculation, and absence tracking. It ensures data transparency, minimizes administrative effort, and enhances user experience across all academic roles.  Built on a Firebase backend with modular architecture, the system guarantees performance, scalability, and secure access control. The intuitive UI is fully responsive and role-specific, designed to operate seamlessly on mobile devices and tablets. This project reflects a robust application of object-oriented design, UML-based planning (use case, class, and sequence diagrams), and real-world database integration.",
      "client": " B&B University",
      "images": [
        "/uploads/b6ecf9498af3afbd24ecd9018c673aa2",
        "/uploads/73722070710a6bb5ec448deeb8f1fba9",
        "/uploads/1562cd33116ec7debc2b097f9c6aa1be",
        "/uploads/475f884fe8a108c7c20622108bfef2be",
        "/uploads/f5251237e19e2ff2420951ba9a98902e"
      ]
    }
  ],
  "skills": {
    "Mobile Development": [
      "Android Studio",
      "Java",
      "Kotlin",
      "XML",
      "SQLite",
      "Firebase",
      "API Integration"
    ],
    "Web Development": [
      "HTML5",
      "CSS3",
      "JavaScript",
      "React",
      "Node.js",
      "PHP",
      "MySQL"
    ],
    "Tools & Technologies": [
      "Git",
      "GitHub",
      "VS Code",
      "Figma",
      "Postman",
      "Docker",
      "Linux"
    ]
  },
  "education": [
    {
      "date": "2021 - Present",
      "title": "EMSI (Ecole Marocaine des Sciences de l'Ingénieur)",
      "subtitle": "University",
      "description": "Currently pursuing my engineering degree with a focus on software development and computer science fundamentals."
    },
    {
      "date": "2023 - 2024",
      "title": "ALX Software Engineering Program",
      "subtitle": "Certificate Completed",
      "description": "Completed comprehensive software engineering bootcamp covering full-stack development, algorithms, data structures, and industry best practices."
    }
  ],
  "experience": [
    {
      "date": "2024 - Present",
      "title": "Freelance Developer",
      "subtitle": "Self-Employed",
      "description": "Providing custom Android app development and website creation services to clients worldwide. Specializing in modern, responsive designs and robust functionality."
    },
    {
      "date": "2021 - 2024",
      "title": "Main Developer",
      "subtitle": "Media Space Solutions",
      "description": "Served as the main developer for 3 years, leading development projects, architecting solutions, and delivering high-quality applications for diverse clients."
    }
  ]
}